{
  "title": "Reflections from some statements of Al-Allamah Rabee Bin Hadi Al-Mad’khali [5 of 80]",
  "author": "Abu Anwar An-Nijiriy",
  "contentIntro": "In The Name of Allah, The Most Merciful, The Bestower of Mercy.",
  "contentBody": "Al-Allamah Rabee Bin Hadi Al-Mad’khali, may Allāh preserve him, said:The comprehensive Shariah understanding of Al-Fiqh Fid Deen (Understanding of The Religion) “Whoever Allah wishes good for, He grants him understanding in the religion”: When this  “Understanding of the religion” is mentioned amongst the people, they understand it to mean the books of Islamic jurisprudence (the books that discuss the rulings related to prayer, zakat, fasting, marriage etc.). This is a deficient understanding. Fiqh (understanding) first and foremost is the understanding of the creed and Tawhid. This is the highest level of Fiqh because the nobility of knowledge is determined based on the nobility of its subject matter. The best and noblest subject matter is Tawhid that teaches the people about the Attributes of their Lord and the perfection of His Attributes, His Oneness, to worship Him (alone) and sincerely establish the religion for His Sake.Therefore, we seek understanding of Tawhid from Allah’s Book, the Sunnah of Allah’s Messenger, peace and blessings of Allāh be upon him, and from the understanding of our pious predecessors. We seek understanding in all areas of knowledge – understanding of halal and haram, acts of worship, mutual dealings, economics and in every affair. All these affairs – and all praise and thanks be to Allah – are extensively (found) within the (message) conveyed by Muhammad, peace and blessings of Allāh be upon him. When Fiqh is mentioned, its intended (meaning includes) understanding of every matter that is connected to our religious and worldly affairs, and the foremost of them is the knowledge of Tawheed. There is nothing that can do without the knowledge of Tawheed. Some people deeply preoccupy with sciences and subject matters, but not acquainted with this knowledge conveyed by the Messenger, to such extent that you find many people who are well versed in language, Islamic jurisprudence, philosophy and the science of rhetoric; but – by Allah – he does not know (correct meaning) of “Laa ilaaha illal laah” – the Islamic Monotheism that Allaah sent all the Messengers with- the first and last of them. [وَلَقَدۡ بَعَثۡنَا فِى ڪُلِّ أُمَّةٍ۬ رَّسُولاً أَنِ ٱعۡبُدُواْ ٱللَّهَ وَٱجۡتَنِبُواْ ٱلطَّـٰغُوتَ‌ۖ – And verily, We have sent among every Ummah (community, nation) a Messenger (saying): “Worship Allah (alone), and avoid (or keep away from) all false deities.”] [An-Nahl. 36] Every Messenger conveyed this until the advent of the seal of the Messengers Muhammad, peace and blessings of Allāh be upon him, who resided in Makkah for ten years and called to Tawhid. Tawhid was the foremost aspect and basis of his call. The prayer – the second pillar of Islam after the testimony of faith ‘Laa ilaaha illal laah – was not legislated until in the 10th year, and the full details of Zakat was not legislated until (after his migration to) Madinah, and all the other laws. This shows the importance of Tawheed, so how is it that many people who ascribe to Islam- those who claim knowledge – are ignorant of it, then what about the ignorant people? Due to this, misguidance, bidah and grave worship has become widespread, and this arose due to ignorance regarding the Names and Attributes of Allah and negation of Allah’s Attributes. A people from the other religions entered into Islam and plotted against the people (through)] corrupt sciences – rhetoric, philosophy, forged historical accounts and what is similar, thus corrupting their creed and methodology The Shaikh also said:(One) must seek understanding of Allah’s Book and the Sunnah of Allah’s Messenger, peace and blessings of Allāh be upon him based on the understanding of the Messenger and the understanding of the pious predecessors – the companions and those who followed them exactly in faith. These matters must be acquired, for whoever opposes anything of it, he will be misguided. What a beautiful statement of Ibn Taymiyyah I have read and was transmitted by Ibn Al-Qayyim: “Whoever opposes the proofs will be misguided from the (right path) and there is no proof except that which the Messenger brought”. Our proof is the Qur’an and Sunnah, and whoever is deprived of it- in any affair- will be misled. This is a true statement and it is what the Messenger and the companions have stated and followed aforetime whilst seeking understanding of the religion. A proof – in any affair related to the religion – is “Allah said and Allah’s Messenger said”. At present, there are affairs whose proofs reach a thousand in number, but you do not find them in the books of the people of misguidance. They have been misguided from the right path and deprived of numerous proofs.The Ahnaf (i.e. Hanafis) state in their definitions of Fiqh that it is of two types: The Fiqh al kabir Wal Akbar. Fiqh al kabir – according to them – is the understanding related to the Shariah rulings and the subsidiary issues of the religion, and what is similar to that. This is a great affair! However, what is greater than it and must be acquired – and the people will not rejoice except through – is the understanding of Tawheed and Iman. This is the greater Fiqh – meaning, we seek understanding of our religion and understand the two types of Fiqh – the Fiqh Al-kabir and the Fiqh Al-Akbar. The Fiqh Al-Akbar is the understanding of Tawheed and Iman, and the Fiqh Al-kabir is the Fiqh through which we can distinguish between halal and haram, truth and falsehood. We derive it from the book of Allah, the sunnah of the Messenger and the understanding of our pious predecessors. We utilise their understanding to aid us understand, as well as what they left behind for us in the Arabic language, Usul Al-Fiqh, and Usul Al-Hadith- the science through which ahadith are declared authentic or weak. All these affairs must be acquired by the students of knowledge and they cannot do without it.The person who studies Fiqh and does not give importance to the proofs- does not distinguish between what is authentic and weak – will fall into very big mistakes, for he might worship Allah based on a weak or fabricated hadith. Therefore, he must distinguish between authentic and weak hadith. Ahmad Ibn Ishaaq, may Allāh have mercy uponhim, –  an Imam of Fiqh and Hadith- said: ‘’The one who does not distinguish between authentic and weak hadith is not a scholar.’’ Why is this (the case)? Because he might worship Allah, declare something halal or haram based on weak or fabricated ahadith, thus he harms himself and the people. Whoever is deprived of proof will be misled from the right path and this is a principle cited in every affair related to religion. Therefore, it is obligated to you to acquire understanding of the religion based on the path of the pious predecessors. When a companion was asked a question, he would answer with a verse and a hadith, and never said, “My opinion is such and such”. He would never exit the text of the Shariah in his answer, except if no evidence reaches him; then he would strive to reach a verdict as that textual proof was with someone else because this person did memorise something and that one memorised something else, and that third person missed something. So, he fears Allah and strives to reach a verdict based on what his ability allows him and the text available to him, and then says: “Allah says and the Messenger says.’’ If he does not have proof, he strives to reach a verdict and says: “This is my view. If I’m correct, it is from Allah; but if I’m mistaken, it is from myself and Shaytaan”. This is what Ibn Mas’ud, may Allāh be pleased with him, and other than him used to say. Whenever AbuBakr, may Allāh be pleased with him, was compelled due to a need and he did not have a textual proof from Allah (i.e. Qur’an] or what the Messenger, peace and blessings of Allāh be upon him, said regarding such and such matter, -and also Umar, may Allāh be pleased with him, used to do the same; he asked someone younger than him and finds a hadith related to the matter from someone younger than him amongst the companions, and from the latter companions, such as Al-Mugheerah Ibn Shu’bah, may Allāh be pleased with him. ",
  "contentEnd": "An Excerpt from “Marhaban Yaa Taalib Al Ilm – pages 243-247",
  "postDate": "Posted on 27th January 2022"
}
